列表 list
列表的定义：
列表是由一系列元素组成的，元素和元素之间可能没有任何关联关系，但他们之间有
先后顺序关系
列表是一种容器
列表是一种序列
列表是可以被改变的序列

列表与字符串：
　１．列表和字符串都是序列，元素之间有先后顺序
　２．字符串是不可变的序列，而列表是可变的序列
　３．字符串中的每个元素只能存储字符，而列表可以存储任意类型的元素
　４．列表和字符串都是可迭代对象
元组　tuple
  元组是不可改变的序列；同list一样，元组可以存放任意类型的元素
  表示方法：　　
    用小括号()括起来，单个元素括起来后加逗号(,)区分单个对象还是元组
  创建空元组的字面值
  t=()

字典　dict
什么是字典：
　　字典是一种可变的容器，可以存储任意类型的数据
　　字典中的每个数据都是用键进行索引的，而不像序列可以用下标(index)来进行
索引
字典中的数据没有先后顺序关系，字典的存储是无序的
字典中的数据以键(key)-值(value) 对的形式进行映射存储
字典的键不能重复，且只能用"不可改变类型"作为字典的键
集合　set
  集合是可变的容器
  集合内的数据对象都是唯一的(不能重复多次)
  集合是无序的存储结构，集合中的数据没有先后顺序关系
  集合内的元素必须是不可变对象
  集合是可迭代对象
  集合相当于只有键没有值得字典(键则是集合的数据)
 